[
  {
    "id": 1,
    "title": "Phishing: Tactics Unveiled",
    "content": [
      "## What is Phishing?",
      "Phishing attacks generally involve tricking a victim into revealing some personal and important information." ,
      "The most basic example involves a legitimate looking email being sent to a victim which contains a link to a legitimate looking (but fake) website. ",
      "There is some urgency within the email which prompts the victim to go to the phishing site, and enter their credentials without knowing that the site is not real.",
      "The attacker can then sell that data or use it for other nefarious purposes.",
      "\nAnother way to think of phishing is the literal act of ‘fishing’, where a victim gets lured in by some exploited motivation with sensitive information",
        "being the end reward that is being ‘fished’ for by the attacker.",
      "## Common Types of Phishing Attacks",
      "There are multiple different ways phishing attacks can take shape, with some common types being outlined below:",
      "- **Email Phishing** &mdash; an email which appears well formatted and trustworthy is sent to you. ",
        "Although it contains a malicious link or file, many people may not spot the red flags (for reasons which will be explained later).",
      "- **Spear Phishing** &mdash; a more dangerous and effective approach, spear phishing usually relies on publicly available data about an individual/victim to specifically target that person.",
        "The fact that it’s not generic may catch the unaware off guard.",
      "- **Website Forgery / HTTPS Phishing** &mdash; while usually stemming from a phishing email, this type of attack ultimately relies",
      "on users entering their credentials to a fake website which appears legitimate and/or mimics a legitimate website.",
      "- **Whaling** &mdash; similar to spear phishing but where the target is usually a senior executive or other powerful employee within an organisation or business.",
      "- **SMS Phishing & Pop-Up Phishing** &mdash; like email phishing but using SMS or embedded website data to implement the attack.",
      "- **Search Engine Phishing** &mdash; where scammers create a fake website and by exploiting search engine optimisation,",
        "manage to trick search engines into displaying the site at a location where it is likely to attract unsuspecting victims.",
      "## Why does this attack work?",
      "Before exploring how to protect ourselves from this attack, it would be wise to employ the ***attacker mindset*** to dig deeper and examine why it actually works in the first place.",
      "First, in the context of email or SMS phishing specifically, there is usually the notion of urgency.",
      "Not only does an email informing asking you to immediately change your credentials because your bank account was comprised drive you to respond &mdash;",
      "but it is also more likely to put you in a ***hot state*** where you are thinking less rationally and are less likely to spot the surrouding red flags. ",
      "Little details like your name being misspelled or grammatical errors in the email may be obvious in hindsight, but weren't so when you were angry, confused or scared.",
      "\nHowever, a state of anger or confusion aren't the only qualities that can be appealed to.",
      "The classic Nigerian prince scam, for example, usually targets greed to cloud the victim's judgment.",
      "This is where psychology really comes to play, as ***confirmation bias*** may result in someone actually deliberatel or subconsciously ignoring the red flags, ",
      "as they seriously want the idea of the scam to be true and a transfer of royal funds into their account to materialise. ",
      "\n***Overconfidence bias*** is another potent tool of attackers here, and one that isn't limited to certain types of scams either.",
      "As humans, we tend to overestimate our abilities either because of past experiences or things like our job title.",
      "Just because someone spotted out a phishing scam once, does not mean are immune to slip ups or mistakes and are guaranteed to spot a more advanced scam next time.",
      "\nSuch overconfidence may also contribute to signifcant amount of shame when one does fall victim to a phishing attack.",
      "Does anyone ever want to admit that they have been scammed?",
      "Does anyone want to admit that this scam occurred because the attacker exploited, for example, their unrealistic hopes for wealth?",
      "While ***shame*** might not be a cybersecurity concept in and of itself, it does have significant psychological ramifications that benefit attackers.",
      "Shame might preclude someone from reporting the scam, which in turn keeps the scam dangerous and novel if the public remains unaware of it.",
      "But shame may also prompt a victim to altogether reject cybersecurity awareness and education, as they desperately seek to forget a traumatic experience.",
      "\n Another tool in the arsenal of an attacker is the idea of ***trust***.",
      "The reality is, that significant aspects of society throughout history have depended on trusting one another.",
      "Trusting that the friend we lend to pays us back, trusting that each driver is paying attention to the road.",
      "However, trust also inherently lowers our guard and makes us more compliant and amicable.",
      "Most people would be hesitant to trust an email from someone they don't know.",
      "But when the email is from our bank, or a colleague at work, surely it's real and not just an intricate attempt to spear phish us?",
      "## How Can We Protect Ourselves?",
      "The most common advice for dealing with phishing often revolves around being cautious with links or attachments, or reading emails 'carefully'.",
      "However, such advice neglects the reality that phishing can occur in any setting (not just via email), as well as the fact",
      "that most victims will be vulnerable due to being in a ***hot state***, and thus are liable to quickly discard all reservations regarding links or attachments.",
      "\n The reality is that the most effective method to protect yourself from phishing is taking a step back and trying to make decisions with a clear and rational mind.",
      "Take this vital step and ask yourself questions such as: \"is this too good to be true?\" ",
      "Because with most scams that seek to swindle you out of money, the answer will indeed be that the proposition is way too good to be true.",
      "\nFor phishing attacks that are less focused on greed and rely more on urgency, try and verify information through official channels.",
      "You could for example, contact your bank or your work colleague directly to follow-up on any concerning emails.",
      "If the phishing is relying on a personal connection of yours, such as in the case of voice phishing, try and ask personal questions to determine whether you are actually talking to that person. ",
      "\n This is especially important when it comes to links.",
      "Instead of clicking on a link sent to you asking you to reset your password, why not just go to the website directly to perform this action?",
      "In the end, it's only marginally slower and you effectively eliminate the chance that you're tricked by a forged website.",
      "\n Another thing you could do with regard to websites/links you are suspicious of but too curious to ignore is, at the very least, open them on your phone.",
      "This is because mobile apps tend to be more sandboxed and dependant on stricter permissions to utilise different functions, resulting in a smaller chance for malicious code to execute.",
      "If you do this, you may also notice that the fake website's layout on a phone is completely wrong due to the website's architecture being only setup to deceive PC users.",
      "\nLastly, it is important to report both successful and unsuccessful fishing attackings that you experience.",
      "While there may be serious shame and stigma associated with doing so, public awareness can seriously alleviate phishing attacks by helping others recognise and avoid similar threats.",
      "Furthermore, where authorities or in-house cybersecurity does get involved early, there may be a serious reduction in the damage that occurs to you personally or to your organisation.",
      "\nBut ultimately, the most vital aspect of cybersecurity remains the fact that if you want to stay safe, **you have to think like an attacker**."
    ],    
    "sources": [
      "## Further Reading",
      "* [Cloudflare - Phishing Attack](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)",
      "* [Phishing.org - What is Phishing?](https://www.phishing.org/what-is-phishing)",
      "* [Cyber.gov.au - Phishing](https://www.cyber.gov.au/threats/types-threats/phishing)",
      "* [UpGuard - Types of Phishing Attacks](https://www.upguard.com/blog/types-of-phishing-attacks)"
    ],
    "tags": ["Psychology", "Scam", "Social Engineering"]
  },
  {
    "id": 2,
    "title": "Security & Romance",
    "content": [
      "## The Context",
      "In 2024, over $34.3 million AUD was lost due to romance scams. ", 
      "The top contacting methods included social media, email and mobile apps.", 
      "Individuals aged between 55 and 64 contributed the most to the total loss figure (~$10m).",
      "While men outnumbered women in the number of reports (57% vs 40%), women contributed more to actual losses (69% vs 31%).",
      "\nThere's something really heartbreaking about the notion of not only realising that your partner is a scammer or doesn't exist,",
      "but also knowing that all the time and money lost on that relationship are things you will never get back.",
      "\n Romance scams can be ruthless, and it doesn't matter if you're a young buck spending your McDonalds wage on a mysterious Roblox girlfriend or a lonely widow of 65 putting up your pension... ",
      "\n\n **YOU COULD BE NEXT.**",
      "## The Best Solution - ATTACKER MINDSET",
      "Let's be real here, devising tips and tricks for avoiding romance scams is absolutely pointless if we don't have a good understanding of the scammer's perspective.",
      "So let's play a little game &mdash; I play the role of a romance scammer and tell you what my approach would be and you translate that into patterns you could personally indentify.",
      "\n1\\. First, as a scammer, the location where I meet my victims is significant. I don't want to spend my time somewhere I won't be seen or will be ignored.",
      "Dating apps and social media are the key standouts. I can utilise online anonimity while not having the encounter be completely out of the ordinary or too good to be true.",
      "After all, millions of people meet each other through these avenues every day, don't they?",
      "\n2\\. The next and possibly the most important thing for me (or any scammer) really is a great first impression.",
      "Catching someone's attention is a fine line, draw too much attention and you get blocked, draw too little and you get ignored or forgotten.",
      "I also want an online profile that is well suited for the job.",
      "I don't want to reveal too much information about myself because it might get verified and blow my cover but I also need to reveal something to not seem like a complete bot or spammer.",
      "\n3\\. Naturally, the features of my target are key here.",
      "Am I looking for victims that are female or male?",
      "What age group do I want my victims to be in?",
      "The characteristics of my victim group will guide my online profile and my persona, the way I speak, the hobbies I have and showcase.",
      "Importantly, stats don't lie here &mdash; people that are older have more access to money, they are also likely to be more gullible when it comes to new technologies and scams.",
      "On the other hand, there's a lot of young and socially vulnerable men out there, who might more easily fall for the bait.",
      "They might not have huge cash at the moment, but their spending power will grow over time and they could become a future cash cow.",
      "\n4\\. The next step is a slow one but it's vital because it involves earning the victim's trust.",
      "If I flew under the radar, and my victim is unsuspecting, it is still a long process before I will reap any rewards.",
      "Whatever hobbies my victim has, I happen to have ones that are remarkably similar.",
      "I'm always of a compatible religion and political affiliation (not hard to mirror when most people reveal such info on social media or allude to it in conversation).",
      "Importantly, I do not ask for or talk about money at the early stages.",
      "It is risky and may just be what rings the alarm bells for someone I just met.",
      "\n5\\. Building on the last step, I also need to demonstrate high and constant levels of affection for my victim. The notion of 'lovebombing'. ",
      "The quickest way to earn trust is to always be available and kind to someone.",
      "Some minor drama or hiccups are fine here and there to mirror the realities of life, but if I can't provide an attractive enough illusion over time, why would my victim like me?",
      "\n6\\. It is also worth mentioning, that people may have an antiquated view of a romance scam.",
      "People might expect some non-English speaker communicating exclusively through typing, but it doesn't have to be that way.",
      "Technology has evolved significantly, and I can use an AI voice-changing app to communicate real time with my victim, even if I'm pretending to be of a different sex.",
      "Even if such AI technology isn't perfect and still has hiccups, I could combine the AI software with a cheap microphone and artificial vocal distortions to mask this and just make it look like I'm using an older device or on a laggy network.",
      "As for the visual element, I could either steal someone else's identity and use their pictures or I could experiment with AI image generation.",
      "Most people, young or old, have no idea how to reverse image search.",
      "And while younger people may easily recognise an AI-generated image, someone who is older with poor eyesight might still get fooled by it, building huge amounts of trust in the process.",
      "\n6\\. The final step, though it could easily be a drawn out one, involves reaping the rewards and actually obtaining finances or money from my victim.",
      "While it's never a guaranteed feat, I do have some factors working in my favour at this point.",
      "Sunk-cost fallacy and confirmation bias are very real, and someone whose been talking with me for months or years will simply refuse to believe or consider that I could be a scammer this late into our 'relationship'.",
      "Anchoring and conservatism bias are also possible here &mdash; even if I ask for a seriously large loan months/years in, it is unlikely to substantially alter the preconceived notions my victim has about me.",
      "Another advantage I have is that I'm not stupid, and won't just ask for a huge amount of cash out of the blue and for no good reason.",
      "I will have to put my victim in a hot state if I want to improve the scam's chances of success.",
      "Maybe one of my parents was in a car crash and is terribly hurt, maybe I'm sick with a serious illness, maybe I want to be with you but it just costs too much to get a passport in my corrupt country,",
      "the point is that I need money, and I need money urgently.",
      "I can't really back out now, so I need to pull out every tool I have.",
      "I will plead, beg, gaslight, and threaten to end the relationship if you don't support me now,",
      "it is, after all, a natural response to have in such a situation...",
      "\n7\\. Finally, when the scam is a success and I leave my victim penniless or they wise up to what is happening, I can fully disappear.",
      "I could delete my accounts, throw away my cheap burner phone. ",
      "If I'm in a third world country across the world, I might not even have to do anything at all since my country is unlikely to prosecute me.",
      "I could always also sell my victim's data or use it to blackmail them if I know they aren't coming back."
    ],
    "sources": [
      "## Further Reading",
      "* [Scamwatch - Online Dating and Romance Scams](https://www.scamwatch.gov.au/types-of-scams/online-dating-and-romance-scams)",
      "* [Scamwatch - Scam Statistics](https://www.scamwatch.gov.au/research-and-resources/scam-statistics)"
    ],    
    "tags": ["Psychology", "Scam", "Social Engineering"]
  },
  {
    "id": 3,
    "title": "Understanding Malware: Beyond the Basics",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Online Safety", "Cybersecurity", "Privacy", "Scam"]
  },
  {
    "id": 4,
    "title": "Hacked in Transit",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Online Safety", "Cybersecurity", "Privacy"]
  },
  {
    "id": 5,
    "title": "Zero Trust Architecture",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Cybersecurity", "Privacy"]
  },
  {
    "id": 6,
    "title": "The Psychology Behind Passwords",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Cybersecurity", "Online Safety", "Psychology"]
  },
  {
    "id": 7,
    "title": "Cyber Warfare: Chaos or Opportunity?",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Cybersecurity", "Privacy"]
  },
  {
    "id": 8,
    "title": "IoT & Cybersecurity",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Cybersecurity", "Privacy", "Technology"]
  },
  {
    "id": 9,
    "title": "Ethical Hacking: An Intriguing Moral Dilemma",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["Cybersecurity", "Privacy"]
  },
  {
    "id": 10,
    "title": "The Role of AI in Cybersecurity",
    "content": [
      "Line 1", 
      "Line 2", 
      "Line 3",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [abcd](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)"
    ],    
    "tags": ["AI", "Cybersecurity", "Technology"]
  }
]