[
  {
    "id": 1,
    "title": "Phishing: Tactics Unveiled",
    "content": [
      "## What is Phishing?",
      "Phishing attacks generally involve tricking a victim into revealing some personal and important information." ,
      "The most basic example involves a legitimate looking email being sent to a victim which contains a link to a legitimate looking (but fake) website. ",
      "There is some urgency within the email which prompts the victim to go to the phishing site, and enter their credentials without knowing that the site is not real.",
      "The attacker can then sell that data or use it for other nefarious purposes.",
      "\nAnother way to think of phishing is the literal act of ‘fishing’, where a victim gets lured in by some exploited motivation with sensitive information",
        "being the end reward that is being ‘fished’ for by the attacker.",
      "## Common Types of Phishing Attacks",
      "There are multiple different ways phishing attacks can take shape, with some common types being outlined below:",
      "- **Email Phishing** &mdash; an email which appears well formatted and trustworthy is sent to you. ",
        "Although it contains a malicious link or file, many people may not spot the red flags (for reasons which will be explained later).",
      "- **Spear Phishing** &mdash; a more dangerous and effective approach, spear phishing usually relies on publicly available data about an individual/victim to specifically target that person.",
        "The fact that it’s not generic may catch the unaware off guard.",
      "- **Website Forgery / HTTPS Phishing** &mdash; while usually stemming from a phishing email, this type of attack ultimately relies",
      "on users entering their credentials to a fake website which appears legitimate and/or mimics a legitimate website.",
      "- **Whaling** &mdash; similar to spear phishing but where the target is usually a senior executive or other powerful employee within an organisation or business.",
      "- **SMS Phishing & Pop-Up Phishing** &mdash; like email phishing but using SMS or embedded website data to implement the attack.",
      "- **Search Engine Phishing** &mdash; where scammers create a fake website and by exploiting search engine optimisation,",
        "manage to trick search engines into displaying the site at a location where it is likely to attract unsuspecting victims.",
      "## Why does this attack work?",
      "Before exploring how to protect ourselves from this attack, it would be wise to employ the ***attacker mindset*** to dig deeper and examine why it actually works in the first place.",
      "First, in the context of email or SMS phishing specifically, there is usually the notion of urgency.",
      "Not only does an email informing asking you to immediately change your credentials because your bank account was comprised drive you to respond &mdash;",
      "but it is also more likely to put you in a ***hot state*** where you are thinking less rationally and are less likely to spot the surrouding red flags. ",
      "Little details like your name being misspelled or grammatical errors in the email may be obvious in hindsight, but weren't so when you were angry, confused or scared.",
      "\nHowever, a state of anger or confusion aren't the only qualities that can be appealed to.",
      "The classic Nigerian prince scam, for example, usually targets greed to cloud the victim's judgment.",
      "This is where psychology really comes to play, as ***confirmation bias*** may result in someone actually deliberatel or subconsciously ignoring the red flags, ",
      "as they seriously want the idea of the scam to be true and a transfer of royal funds into their account to materialise. ",
      "\n***Overconfidence bias*** is another potent tool of attackers here, and one that isn't limited to certain types of scams either.",
      "As humans, we tend to overestimate our abilities either because of past experiences or things like our job title.",
      "Just because someone spotted out a phishing scam once, does not mean are immune to slip ups or mistakes and are guaranteed to spot a more advanced scam next time.",
      "\nSuch overconfidence may also contribute to signifcant amount of shame when one does fall victim to a phishing attack.",
      "Does anyone ever want to admit that they have been scammed?",
      "Does anyone want to admit that this scam occurred because the attacker exploited, for example, their unrealistic hopes for wealth?",
      "While ***shame*** might not be a cybersecurity concept in and of itself, it does have significant psychological ramifications that benefit attackers.",
      "Shame might preclude someone from reporting the scam, which in turn keeps the scam dangerous and novel if the public remains unaware of it.",
      "But shame may also prompt a victim to altogether reject cybersecurity awareness and education, as they desperately seek to forget a traumatic experience.",
      "\n Another tool in the arsenal of an attacker is the idea of ***trust***.",
      "The reality is, that significant aspects of society throughout history have depended on trusting one another.",
      "Trusting that the friend we lend to pays us back, trusting that each driver is paying attention to the road.",
      "However, trust also inherently lowers our guard and makes us more compliant and amicable.",
      "Most people would be hesitant to trust an email from someone they don't know.",
      "But when the email is from our bank, or a colleague at work, surely it's real and not just an intricate attempt to spear phish us?",
      "## How Can We Protect Ourselves?",
      "The most common advice for dealing with phishing often revolves around being cautious with links or attachments, or reading emails 'carefully'.",
      "However, such advice neglects the reality that phishing can occur in any setting (not just via email), as well as the fact",
      "that most victims will be vulnerable due to being in a ***hot state***, and thus are liable to quickly discard all reservations regarding links or attachments.",
      "\n The reality is that the most effective method to protect yourself from phishing is taking a step back and trying to make decisions with a clear and rational mind.",
      "Take this vital step and ask yourself questions such as: \"is this too good to be true?\" ",
      "Because with most scams that seek to swindle you out of money, the answer will indeed be that the proposition is way too good to be true.",
      "\nFor phishing attacks that are less focused on greed and rely more on urgency, try and verify information through official channels.",
      "You could for example, contact your bank or your work colleague directly to follow-up on any concerning emails.",
      "If the phishing is relying on a personal connection of yours, such as in the case of voice phishing, try and ask personal questions to determine whether you are actually talking to that person. ",
      "\n This is especially important when it comes to links.",
      "Instead of clicking on a link sent to you asking you to reset your password, why not just go to the website directly to perform this action?",
      "In the end, it's only marginally slower and you effectively eliminate the chance that you're tricked by a forged website.",
      "\n Another thing you could do with regard to websites/links you are suspicious of but too curious to ignore is, at the very least, open them on your phone.",
      "This is because mobile apps tend to be more sandboxed and dependant on stricter permissions to utilise different functions, resulting in a smaller chance for malicious code to execute.",
      "If you do this, you may also notice that the fake website's layout on a phone is completely wrong due to the website's architecture being only setup to deceive PC users.",
      "\nLastly, it is important to report both successful and unsuccessful fishing attackings that you experience.",
      "While there may be serious shame and stigma associated with doing so, public awareness can seriously alleviate phishing attacks by helping others recognise and avoid similar threats.",
      "Furthermore, where authorities or in-house cybersecurity does get involved early, there may be a serious reduction in the damage that occurs to you personally or to your organisation.",
      "\nBut ultimately, the most vital aspect of cybersecurity remains the fact that if you want to stay safe, **you have to think like an attacker**."
    ],    
    "sources": [
      "## Further Reading",
      "* [Cloudflare - Phishing Attack](https://www.cloudflare.com/en-au/learning/access-management/phishing-attack/)",
      "* [Phishing.org - What is Phishing?](https://www.phishing.org/what-is-phishing)",
      "* [Cyber.gov.au - Phishing](https://www.cyber.gov.au/threats/types-threats/phishing)",
      "* [UpGuard - Types of Phishing Attacks](https://www.upguard.com/blog/types-of-phishing-attacks)"
    ],
    "tags": ["Online Safety", "Psychology", "Scam", "Social Engineering"]
  },
  {
    "id": 2,
    "title": "Security & Romance",
    "content": [
      "## The Context",
      "In 2024, over $34.3 million AUD was lost due to romance scams. ", 
      "The top contacting methods included social media, email and mobile apps.", 
      "Individuals aged between 55 and 64 contributed the most to the total loss figure (~$10m).",
      "While men outnumbered women in the number of reports (57% vs 40%), women contributed more to actual losses (69% vs 31%).",
      "\nThere's something really heartbreaking about the notion of not only realising that your partner is a scammer or doesn't exist,",
      "but also knowing that all the time and money lost on that relationship are things you will never get back.",
      "\n Romance scams can be ruthless, and it doesn't matter if you're a young buck spending your McDonalds wage on a mysterious Roblox girlfriend or a lonely widow of 65 putting up your pension... ",
      "\n\n **YOU COULD BE NEXT.**",
      "## An Alternative Perspective &mdash; Attacker Mindset",
      "Let's be real here, devising tips and tricks for avoiding romance scams is absolutely pointless if we don't have a good understanding of the scammer's perspective.",
      "So let's play a little game &mdash; I play the role of a romance scammer and tell you what my approach would be and you translate that into patterns you could personally indentify and defend against.",
      "\n1\\. First, as a scammer, the location where I meet my victims is significant. I don't want to spend my time somewhere I won't be seen or will be ignored.",
      "Dating apps and social media are the key standouts. I can utilise online anonimity while not having the encounter be completely out of the ordinary or too good to be true.",
      "After all, millions of people meet each other through these avenues every day, don't they?",
      "\n2\\. The next and possibly the most important thing for me (or any scammer) really is a great first impression.",
      "Catching someone's attention is a fine line, draw too much attention and you get blocked, draw too little and you get ignored or forgotten.",
      "I also want an online profile that is well suited for the job.",
      "I don't want to reveal too much information about myself because it might get verified and blow my cover but I also need to reveal something to not seem like a complete bot or spammer.",
      "\n3\\. Naturally, the features of my target are key here.",
      "Am I looking for victims that are female or male?",
      "What age group do I want my victims to be in?",
      "The characteristics of my victim group will guide my online profile and my persona, the way I speak, the hobbies I have and showcase.",
      "Importantly, stats don't lie here &mdash; people that are older have more access to money, they are also likely to be more gullible when it comes to new technologies and scams.",
      "On the other hand, there's a lot of young and socially vulnerable men out there, who might more easily fall for the bait.",
      "They might not have huge cash at the moment, but their spending power will grow over time and they could become a future cash cow.",
      "\n4\\. The next step is a slow one but it's vital because it involves earning the victim's trust.",
      "If I flew under the radar, and my victim is unsuspecting, it is still a long process before I will reap any rewards.",
      "Whatever hobbies my victim has, I happen to have ones that are remarkably similar.",
      "I'm always of a compatible religion and political affiliation (not hard to mirror when most people reveal such info on social media or allude to it in conversation).",
      "Importantly, I do not ask for or talk about money at the early stages.",
      "It is risky and may just be what rings the alarm bells for someone I just met.",
      "\n5\\. Building on the last step, I also need to demonstrate high and constant levels of affection for my victim. The notion of 'lovebombing'. ",
      "The quickest way to earn trust is to always be available and kind to someone.",
      "Some minor drama or hiccups are fine here and there to mirror the realities of life, but if I can't provide an attractive enough illusion over time, why would my victim like me?",
      "\n6\\. It is also worth mentioning, that people may have an antiquated view of a romance scam.",
      "People might expect some non-English speaker communicating exclusively through typing, but it doesn't have to be that way.",
      "Technology has evolved significantly, and I can use an AI voice-changing app to communicate real time with my victim, even if I'm pretending to be of a different sex.",
      "Even if such AI technology isn't perfect and still has hiccups, I could combine the AI software with a cheap microphone and artificial vocal distortions to mask this and just make it look like I'm using an older device or on a laggy network.",
      "As for the visual element, I could either steal someone else's identity and use their pictures or I could experiment with AI image generation.",
      "Most people, young or old, have no idea how to reverse image search.",
      "And while younger people may easily recognise an AI-generated image, someone who is older with poor eyesight might still get fooled by it, building huge amounts of trust in the process.",
      "\n6\\. The final step, though it could easily be a drawn out one, involves reaping the rewards and actually obtaining finances or money from my victim.",
      "While it's never a guaranteed feat, I do have some factors working in my favour at this point.",
      "Sunk-cost fallacy and confirmation bias are very real, and someone whose been talking with me for months or years will simply refuse to believe or consider that I could be a scammer this late into our 'relationship'.",
      "Anchoring and conservatism bias are also possible here &mdash; even if I ask for a seriously large loan months/years in, it is unlikely to substantially alter the preconceived notions my victim has about me.",
      "Another advantage I have is that I'm not stupid, and won't just ask for a huge amount of cash out of the blue and for no good reason.",
      "I will have to put my victim in a hot state if I want to improve the scam's chances of success.",
      "Maybe one of my parents was in a car crash and is terribly hurt, maybe I'm sick with a serious illness, maybe I want to be with you but it just costs too much to get a passport in my corrupt country,",
      "the point is that I need money, and I need money urgently.",
      "I can't really back out now, so I need to pull out every tool I have.",
      "I will plead, beg, gaslight, and threaten to end the relationship if you don't support me now,",
      "it is, after all, a natural response to have in such a situation...",
      "\n7\\. Finally, when the scam is a success and I leave my victim penniless or they wise up to what is happening, I can fully disappear.",
      "I could delete my accounts, throw away my cheap burner phone. ",
      "If I'm in a third world country across the world, I might not even have to do anything at all since my country is unlikely to prosecute me.",
      "I could always also sell my victim's data or use it to blackmail them if I know they aren't coming back."
    ],
    "sources": [
      "## Further Reading",
      "* [Scamwatch - Online Dating and Romance Scams](https://www.scamwatch.gov.au/types-of-scams/online-dating-and-romance-scams)",
      "* [Scamwatch - Scam Statistics](https://www.scamwatch.gov.au/research-and-resources/scam-statistics)"
    ],    
    "tags": ["Online Safety", "Psychology", "Scam", "Social Engineering"]
  },
  {
    "id": 3,
    "title": "Understanding Malware: Beyond the Basics",
    "content": [
      "\nThis is a dummy article that wasn't finished in time.", 
      "\nHowever, 8 out of the 10 intended articles were finished and you", 
      "can find and read them directly through the **Articles** or **Tags**",
      "pages in the header.",
      "\n"
    ],
    "sources": [
      ""
    ],     
    "tags": ["Online Safety", "Cybersecurity", "Scam", "Technology"]
  },
  {
    "id": 4,
    "title": "Hacked in Transit",
    "content": [
      "## The Man-in-the-Middle Attack",
      "Man-in-the-middle or MITM attacks, as the name implies, are a cyberattack where", 
      "a third party places themselves in the middle of a communication channel being",
      "used by two parties, without either of the two original parties being aware of this.",
      "\n Usually, some type of vulnerability within a specific system forms the",
      "origin of a MITM attack.",
      "A familiar example would be a phishing email, which we explored in our first article,",
      "as an illegitimate link contained in such an email which would infect the user's system with malware,",
      "could also allow the attacker to shape how the user interact with their PC and certain ",
      "websites unbeknownst to them.",
      "Another example of a vulnerability liable to enable MITM attacks involve public wifi hotspots.",
      "These wifi systems tend to be less secure, allowing attackers to either imitate",
      "them and draw unsuspeciting victims or to attack a legitimate router and organise",
      "an attack from there.",
      "\n If it wasn't obvious from the above, the most dangerous feature of a MITM ",
      "attack stem from the fact that it can and often does occur without either of",
      "the two innocent parties being aware that something is amiss.",
      "This differentiates it significantly from a lot of other cyberattacks such as,",
      "malware or denial-of-service attacks, where it is usually quickly apparent",
      "that systems are compromised.",
      "The discreet nature of MITM attacks, allow attackers to obtain valuable information",
      "which they can then utilise to perform other actions such as identity theft or unauthorised purchases.",
      "## MITM Attack Examples",
      "One notable MITM attack was revealed in the Edward Snowden leaks, where the NSA impersonated Google.",
      "The NSA was found to have forged SSL encryption certificates to intercept the search records of potentially millions American Google users.",
      "While the NSA's approach would have likely involved targetting specific individuals or groups of individuals,",
      "the question ultimately goes back to privacy and how much privacy citizens are willing concede to their government",
      "to obtain benefits such as more effective intelligence and law enforcement bodies.",
      "\nAnother company known for employing MITM techniques is Comcast, a major US telecommunications corporation.",
      "Comcast has been accused of injecting JavaScript into its users' web browsers multiple times.",
      "This was done to display intrusive ads or messages, such as data cap warnings or notifications",
      "that users were visiting potentially copyright-infringing websites.",
      "While Comcast's reasons in doing this are arguably not malicious, the notion of an ISP",
      "using code injection against its paying customers is ethically dubious at best.",
      "There are also concerns about the same processes being used by other actors",
      "with far more nefarious purposes.",
      "## Preventing MITM Attacks",
      "When it comes to preventing MITM attacks, there are numerous different steps you can take.",
      "\nAs per our article on passwords, one area that you should devote time to if you want",
      "to reduce the effective of these attacks is overall account security.",
      "This includes building stronger passwords, using a password manager and opting in for",
      "multi factor authentication (MFA) where this is available.",
      "In a way, this reduces the chance for a single point of failure to occur as a result of",
      "an MITM attack. ",
      "\nThe example where this is most obvious is where your credentials get stolen",
      "by a 3rd party who was eavesdropping on your online behaviour. Even though an aspect",
      "of your security is seriously in danger, if you have MFA enabled, not only could",
      "this prevent the attacker from using your credentials but it could also notify",
      "you that something is wrong (depending on how the MFA is configured).",
      "\nSome more basic steps you can take include only visiting HTTPS websites,",
      "though non HTTPS websites are relatively rare to find.",
      "This is helpful as the data exchanged with HTTPS is encrypted due to the",
      "use of SSL and TLS security protocols.",
      "In other words, websites that only utilise HTTP should be avoided.",
      "\nAnother important tip is to avoid public wifi networks, especially",
      "when intending to reveal sensitive data or credentials.",
      "This is especially important for reasons mentioned towards the beginning of this article, such as",
      "potentialy spoofing of these networks by attackers and the fact that they tend ",
      "to have generally weaker security protocols.",
      "\nUltimately, even though MITM attacks may appear highly dangerous, ",
      "there are ways you can protect yourself, and you should take such preventative/educational measures.",
      "before it is too late."
    ],
    "sources": [
      "## Further Reading",
      "* [What is a man-in-the-middle (MITM) attack?](https://www.ibm.com/think/topics/man-in-the-middle)",
      "* [Man-in-the-Middle Attack: Types and Examples](https://www.fortinet.com/resources/cyberglossary/man-in-the-middle-attack)",
      "* [NSA disguised itself as Google to spy, say reports](https://www.cnet.com/tech/tech-industry/nsa-disguised-itself-as-google-to-spy-say-reports/)",
      "* [Comcast using man-in-the-middle attack to warn subscribers of potential copyright infringement](https://www.techspot.com/news/62887-comcast-using-man-middle-attack-warn-subscribers-potential.html)"      
    ],    
    "tags": ["Online Safety", "Cybersecurity", "Privacy"]
  },
  {
    "id": 5,
    "title": "Zero Trust Architecture",
    "content": [
      "The increased avenues of attack for cybercriminals and advancements in technology", 
      "have made it clear that traditional 'castle-and-moat' based security frameworks", 
      "are no longer capable of effectively defending against cyber threats.",
      "Zero Trust Architecture (ZTA), a security model that presumes that any entity attempting to access a network, ",
      "whether inside or outside, could be a potential threat, has gained popularity as a result of this shifts. ",
      "This article will examine what Zero Trust means, how it works and why it's becoming",
      "a standard in the cybersecurity field.",
      "## Zero Trust Architecture: a Definition",
      "The 'Zero Trust Architecture' approach to security requires uncompromising identity",
      "verification for all users and devices trying to access network resources",
      "Importantly, Zero Trust makes the assumption that every user and device",
      "is a potential risk, necessitating continual validation and monitoring",
      "of users and systems.",
      "The ultimate idea is to reduce the possibility of security breaches by ",
      "limiting access to only verified users and trusted devices.",
      "## What is the Problem with Traditional Security Models?",
      "If one were to think about the conventional 'castle-and-moat' model,",
      "where a network or system is supposed to represent the 'castle-and-moat,",
      "they would be rewarded for thinking more deeply about the medieval aspects of this",
      "metaphor.",
      "In other words, the 'castle-and-moat' represents a structure that may be",
      "very difficult for hostile outsiders to breach, and there is naturally zero trust",
      "behind the insiders who live in the castle and the attackers outside.",
      "However, anyone inside is also automatically trusted which presents serious",
      "concerns notwithstanding how robust the castle is against the hordes of invaders",
      "which may be camping outside.",
      "\nBoth along the conception of the castle in literal and digital terms,",
      "someone inside the castle could be dissatisfied with some part of the system.",
      "This may prompt them to become a whistleblower, or a traitor, and they could assist",
      "any outside attackers by letting them in or revealing a vulnerability of the",
      "castle which the attackers may not have been previously aware of.",
      "Moreover, someone inside the castle can also get careless, or make a mistake.",
      "Maybe they reveal a vulnerability accidentally, or maybe they wheel in a",
      "giant wooden horse which they think is a gift from some overseas lord.",
      "\nThis reality &mdash; that the human element is the weakest link in any",
      "system, and that anyone can be an insider threat by virtue of malice, carelessness",
      "or incompetence is why the traditional security model is flawed.",
      "ZTA is simply one mechanism attempting to remedy such core weaknesses.",
      "## Three Fundamental Principles of Zero Trust",
      "Several fundamental ideas are incorporated into ZTA to protect access and stop breaches:",
      "### 1. Continuous Monitoring and Validation",
      "As previously mentioned, ZTA recognises that harm can materialise from",
      "both internal and external threats.",
      "To lessen the possibility of undetected lateral movement occuring inside the network,",
      "mandatory user/device identity verification procedures takes place at each access point,",
      "and sessions regularly time out to demand reauthentication.",
      "### 2. The Notion of Least-Privilege Access",
      "This concept minimises exposure to sensitive regions by granting each user",
      "only the minimal amount of access required for them to effectively do their job.",
      "One example of least-privilege access in a movie/tv-show setting that no",
      "doubt many may remember involves a scene where a government",
      "official says \"I don't have the clearance for that\" or \"his security",
      "clearance level is two levels higher than mine\". The idea here of course",
      "is that employees only have strict access to certain materials, and to access",
      "more, they will need to move up the government agency chain.",
      "\nIn other words, even if a breach does occur, the attacker",
      "might be seriously limited with what they can do with their new found",
      "access/identity. On the other hand, it also makes the high value targets",
      "(targets with overriding or high-level privileges) that much more",
      "valuable, as techniques such as spear-phishing or whaling come into play.",
      "### 3. Assume Breach",
      "Perhaps the most vital principle of ZTA and the one that certainly informs",
      "its nature is the perpetual assumption that made be made regarding the",
      "inevitability of security breaches and failures.",
      "Thus, many aspects of ZTA are not necessarily directed at preventing breaches",
      "per the traditional castle versus attackers model, but rather emphasise",
      "minimising the damage and containment once a breach does (inevitably)",
      "take place.",
      "\nIn a way, this also indirectly accounts for insider threats such as",
      "whistleblowing, because even where the the threat is internal, these containment",
      "and harm minimisation procedures may substantially curb the error, or at the very",
      "least make it clear who the responsible parties are when an internal threat",
      "does materialise.",
      ""
    ],
    "sources": [
      "## Further Reading",
      "* [What is a Zero Trust Architecture](https://www.paloaltonetworks.com.au/cyberpedia/what-is-a-zero-trust-architecture)",
      "* [Zero Trust security | What is a Zero Trust network?](https://www.cloudflare.com/en-au/learning/security/glossary/what-is-zero-trust/)"
    ],    
    "tags": ["Cybersecurity", "Technology"]
  },
  {
    "id": 6,
    "title": "The Psychology Behind Passwords",
    "content": [
      "There are many sites which detail or list the most common passwords.", 
      "These lists are filled with passwords like '1234', 'password', 'qwerty' and many similar variations.", 
      "But what actually causes people to opt for such terrible passwords, is it just a poor understanding of cybersecurity or are there other forces at play?",
      "\nWithout a doubt the biggest concept to mention here is the balance between covenience and security.",
      "There's nothing stopping someone from randomly entering 20 different letters and symbols and submitting that as their password,",
      "but is there any chance they will ever remember this password?",
      "They actually might, if they devote some time to learning it and it's a password they routinely have to use.",
      "But is this a sustainable process for every single website or service where we have to make an account?",
      "\nThat's where convenience comes in. It's great if a password is long, unstructured and uses different letter types,",
      "but passwords also need to be memorable and convenient to use.",
      "Some might also build one strong password but at the cost of using it for every single account,",
      "negating its effectiveness substantially.",
      "This is poor practice, but again, some studies show that the average person has as many as 240 password-protected accounts,",
      "so can you really blame the Average Joe for just taking that mental shortcut when making an account on some seemingly insignificant ecommerce site?",
      "\nThe result is that people get get into habits of making poor passwords or overusing them, ",
      "with both survivorship bias and salience giving people a false perception of how secure their credentials actually are.",
      "Survivorship bias is particularly understandable, because why would a person devote mental resources out of their day",
      "to address a problem (i.e., their password security) when that problem may only potentially lead to negative consequences in the future.",
      "From their perspective, misconceptions lead them to believe that their password is strong,",
      "the platforms that hold their data are secure, or that they are just too insignificant to be a target.",
      "\n Another cognitive factor here is anchoring and confirmation biases.",
      "While a particular password may have been mediocre or strong at some point in time many years ago,",
      "that might not be the case today.",
      "This is not a novel concept, technology and cybersecurity evolve quickly",
      "as more information and data becomes known about different features of the field.",
      "But people may be anchored to an old password they like and remember well.",
      "Maybe that password was considered 'strong' when they first thought it up, despite it only comprising letters and numbers.",
      "Confirmation bias, again, goes to the idea of cognitive load.",
      "People don't want to experience cognitive dissonance or voluntarily take on stress, so if they ever do",
      "see or hear something which tells them that their password is weak, they might ignore it",
      "or somehow view the information as having little credit.",
      "## Password Best Practice Guidelines",
      "Both the NIST (National Institute of Standards and Technology) and the CISA (Cybersecurity & Infrastructure Security Agency)",
      "have detailed guidelines on what constitutes a strong password.",
      "\nThe CISA recommends that passwords be at least 16 characters and contain either unrelated words/phrases or random strings of letters, numbers and symbols.",
      "The CISA also recommends that a different password be used for a different account, minimising the risk that one breach",
      "will drastically effect a user.",
      "\n The NIST, on the other hand, provide guidance on more organisational matters regarding to password security.",
      "For example, the NIST recommend that Two-Factor or Multi-Factor Authentication is employed, accounts are locked after multiple unsuccessful attempts,",
      "and that a password manager is used.",
      "\nThe suggestion of using a password manager is particularly interesting.",
      "While these tend to have biometrics which must be satisfied before you can access the manager and",
      "the human element is reduced since the passwords are encrypted and generated by another party,",
      "the user is arguably more closer to a situation where there exists a single point of failure.",
      "This is because now an attacker who breaches the centralised password manager may have access to every single password,",
      "opposed to the situation where only a specific platform and the user's respective credentials for it are breached.",
      "\n Another interesting aspect of the NIST best practice guidelines is that it does not endorse frequent mandatory update changes.",
      "The reasoning for this is intuitive, as people who are forced to change passwords for an account frequently are",
      "more likely to reuse old passwords instead of spending significant mental resources on seriously engaging with the task.",
      "In fact, such an institutional requirement of mandatory update changes to passwords could be described as a clear example of",
      "'security theatre.'",
      "This is because the appearance of such a feature far outweighs its practical utility from a security standpoint."
    ],
    "sources": [
      "## Further Reading",
      "* [Formulate Strong Passwords and PIN Codes](https://www.cisa.gov/resources-tools/training/formulate-strong-passwords-and-pin-codes)",
      "* [NIST Password Guidelines 2024](https://www.auditboard.com/blog/nist-password-guidelines/)",
      "* [The Psychology of Passwords](https://www.itnaturally.com/insight/the-psychology-of-passwords-why-our-brains-sabotage-security/)",
      "* [How to Create Safe Passwords at Work](https://www.dashlane.com/blog/password-psychology-safe-passwords-work)"
    ],    
    "tags": ["Cybersecurity", "Online Safety", "Psychology"]
  },
  {
    "id": 7,
    "title": "Cyber Warfare: Chaos or Opportunity?",
    "content": [
      "## Introduction", 
      "While most of the articles on this site tend to explore security matters which", 
      "are clearly directed towards individuals, such as understanding online scams and password security,",
      "cyber warfare may at first glance seem like a distant concern that isn't really relevant for most people.",
      "\nHowever, the reality is that cyberwarfare is a real threat that can affect a state's citizens",
      "in many different ways.",
      "As societies become more reliant on technology, and methods/vectors of attack",
      "evolve, it is only natural that this increases the reach and seriousness of",
      "events when things do go wrong.",
      "\nCyberattacks launched by states could attempt to, for example, target",
      "the critical infrastructure of other states which include power grids, ",
      "supply chains, transport networks and so on.",
      "These are important areas that could affect millions of citizens and lead",
      "to national emergencies depending on the attack's context.",
      "\nMore straightforward scenarios could also include attacks against",
      "financial institutions or corporations which may be directly or indirectly",
      "associated with the government.",
      "Especially, in the context of attacks against businesses, it is also important",
      "to note that damage is not limited to the financial type.",
      "Sensitive data may be stolen about citizens, disrupting both day-to-day operations",
      "of the business as well as putting the citizens at risk depending",
      "on what occurs with the data.",
      "\nAnother important factor to consider here is the clandestine nature of cyberwarfare.",
      "It's hard to definitively determine where the boundaries between state and non-state actors",
      "lie and which parties are truly responsible for attacks.",
      "Much of the discussion in this realm may involve speculation, conspiracy theories",
      "and governments pointing fingers at each other along political lines.",
      "## Types of cyberwarfare",
      "Imperva, an American cybersecurity company, breaks down cyberwarfare into",
      "seven common types &mdash; this framework will be a useful outline to",
      "structure our discussion within this article.",
      "\n**1\\. Espionage**",
      "\nWhile espionage between states is not a particularly novel concept and can",
      "be dated back many centuries, most people may associate the concept more with the Cold War",
      "or World War II as opposed to contemporary cyberwarfare.",
      "However, governments have a lot to hide, and it is only natural that this information",
      "can be highly useful to a diverse group of adversaries.",
      "Friendly governments also, for various reasons, spy on each other,",
      "meaning cybersecurity in this sphere is almost destined to rely on principles of zero trust.",
      "\n**2\\. Sabotage**",
      "\nWhile espionage may involve obtaining secrets or sensitive data discreetly,",
      "sabotage is more centred around leveraging insider threats in more brazen circumstances.",
      "Social engineering becomes increasingly important here as well, as the weakest link",
      "in most systems tend to be humans.",
      "Public sector employees involved in such attack may not necessarily",
      "always be compromised by a foreign power or delbierately treasonous",
      "but may simply just be careless, incompetent or caught offguard",
      "by a seriously clever attack.",
      "\n**3\\. Denial-of-Service Attacks**",
      "\nDoS attacks tend to involve attacking a specific servier, or network",
      "with the goal of disrupting partially or completely disrupting its",
      "operation. Side-effects usually involve reputational or financial damage",
      "to the owner and state involved with the system.",
      "\n**4 & 5\\. Critical Infrastructure & Economic Attacks**",
      "\nAlthough these may be classified as different types of attack,",
      "they are also arguably highly similar due to their consequences,",
      "which often involve causing operational-related damages, and reputational losses",
      "liable to generate outrage within a populace against their (unsecured/weak) government.",
      "Conversely, such attacks may also give the attacked government a avenue to rally",
      "their citizens, with this outrage possibly being directed towards a specific country",
      "where political animosity has already been present prior to the attacks.",
      "\n**6\\. Propoganda Attacks**",
      "\nThis is arguably the most complex and controversial use of cyberwarfare",
      "on Imperva's list.",
      "There's a lot of different ways propaganda can be packaged, including",
      "disinformation, opinions/truth presented in a biased manner, content ",
      "designed to radicalise, and everything in between.",
      "The most 'cyber' feature of this attack would constitute bots and fake accounts",
      "on social media platforms such as Twitter and Facebook disseminating fake news",
      "and other harmful content.",
      "\nOn the other hand, many American-based social media platforms have arguably",
      "gone too far in trying to reduce/manage propoganda and misinformation on their platforms and",
      "have infringed on competing notions, such as the freedom of speech.",
      "The echo chambers present within most social media apps/platforms and the",
      "ease with which online radicalisation can materialise has also resulted in many people",
      "throwing the word 'propoganda' around very loosely to the point where there",
      "are questions around whether the term even has a concrete meaning anymore.",
      "\n The concept of justice should also be raised here.",
      "While online 'propoganda' has overwhelmingly negative connotations, one of the key ideas",
      "behind it, and possibly behind cyberwarfare generally, is a levelling of",
      "the playing field.",
      "Countries which are very powerful economically, militarily and/or politically, and",
      "are able of imposing their world-view on other countries through the",
      "three above means, may nevertheless be still challenged by a weaker country",
      "which leverages cyberwarfare capabilities.",
      "Such asymmetrical warfare stems from the fact that attacking in the context",
      "of cybersecurity is a lot easier than attacking through political/economic means",
      "and that countries with huge economies or populations means there is",
      "significantly more potential to find vulnerabilities, be it software or",
      "people.",
      "\n**7\\. Surprise Attacks**",
      "\nThe seventh and last type of cyberwarfare to mention here is the surprise attack.",
      "While this attack will often conceptually overlap with most of the others",
      "on this list, the importance of surprise within cyberwarfare should not be overstated.",
      "As society grows more accustomed to the idea of cyberwarfare and hacking in general,",
      "more in-depth incident response plans will be developed regarding different",
      "infrastructure, systems and software.",
      "The idea of the defending parties being unsure of what course to take",
      "or somehow making their situation worse during the first few days",
      "of a cybersecurity incident is a goal of any attacker in this domain,",
      "and the notion of surprise is only bound to contribute to such outcomes.",
      "## Prototyping an Educational Case Study",
      "While the original aim of this part of the article was to evaluate real-life",
      "cyberwarfare events, this task is incredibly difficult due to",
      "how hard it is to obtain accurate information about incidents in this domain.",
      "Instead, an interesting exercise would be to build an educational",
      "question which could be used for a discussion while linking into the many",
      "cybersecurity aspects involved within cyberwarfare.",
      "### Case Study Question:",
      "Imagine you are a senior Australian Government official involved in the",
      "planning of the top secret Australian nuclear program.",
      "The ultimate aim of this program is to arm Australia with nuclear weapons",
      "which could help the country defend itself along principles of mutually",
      "assured destruction.",
      "\nHowever, the topic of nuclear proliferation and arms development is",
      "politically controversial, especially at the international level.",
      "\nIn your response as a group, highlight what you think the most relevant",
      "stakeholders and assets are.",
      "Then, outline what you think the most vital risks are and possible means",
      "of minimising these risks if Australia is to pursue this course of nuclear",
      "armament.",
      "\nOne specific topic you should refer to in your discussion include the idea",
      "of keeping the program secret, and what strategies could be employed here.",
      "### Links to Cybersecurity:",
      "One reason why this case study would potentially be interesting to individuals",
      "learning about cybersecurity is because it doesn't necessarily require",
      "significant deep reading about nuclear armament for detailed discussions",
      "to take place. And yet there are still different real points of inspiration",
      "that could guide students here such as the nuclear programs of Israel,",
      "India, and Pakistan which all managed to maintain high levels of secrecy.",
      "\nThe idea of secrets is big here, and how students must always be",
      "sure what asset they are targetting &mdash; whether it is software",
      "or humans for example.",
      "Naturally, whistleblowing becomes a relevant concept here as well, and one of",
      "the case study prep instructions could involve doing some reading about Mordechai Vanunu,",
      "a whistleblower who revealed details of Israel's nuclear weapons program.",
      "How would the Australian Government prevent whistleblowing, how would it",
      "deal with such incidents when prevention fails?",
      "\nImportantly, any links made here need not be limited to the field of",
      "something incredibly top-secret like a nuclear arms program.",
      "Many of these topics will be relevant to students who work in any",
      "professional cybersecurity setting.",
      "There is also scope to involve lawyers as opposed to traditional",
      "cybersecurity students/professionals.",     
      "NDAs and domestic Australian laws concerning whistleblowing, are both areas",
      "where a legal education could significantly improve discussions."
    ],
    "sources": [
      "## Further Reading",
      "* [Cyber Warfare](https://www.imperva.com/learn/application-security/cyber-warfare/)"
    ],    
    "tags": ["Cybersecurity", "Technology"]
  },
  {
    "id": 8,
    "title": "IoT & Cybersecurity",
    "content": [
      "The Internet of Things, or IoT, can be definned as the network of physical", 
      "objects that are embedded with sensors, software and network connectivity.", 
      "This encompasses healthcare devices, wearable gadgets, smart home devices",
      "as well as more large-scale infrastructure such as the idea of 'smart cities'.",
      "\nWhile the applications of IoT are limitless and there are clear benefits",
      "that can be derived from these technologies, with a predicted 24",
      "billion IoT devices currently in existence, these technologies also",
      "present a legitimate opportunity for cybercriminals to conduct new",
      "and unexpected types of attacks.",
      "## Cybersecurity Risks in IoT",
      "Below is a list of common vulnerabilities present within IoT devices.",
      "\n**1 &mdash; Absence of encryption**",
      "\nSince many Internet of Things devices do not encrypt data by default,",
      "transmitted data is susceptible to interception or eavesdropping.",
      "In industries where sensitive data may be exposed, such as healthcare ",
      "or industrial settings, this lack of encryption is especially liable",
      "to cause harm to users.",
      "\n**2 &mdash; Inadequate Authentication Measures**",
      "\nWeak authentication methods and inadequate password management systems are",
      "another frequent problem with IoT devices.",
      "Attackers can brute force their way into systems using default",
      "or simple-to-guess passwords, potentially (and seamlessly) compromising entire networks.",
      "\n**3 &mdash; Reliance on Old Softwares**",
      "\nIt is crucial to keep IoT devices updated with the most recent firmware.",
      "Attackers can easily target devices with out-of-date software,",
      " taking advantage of existing flaws and vulnerabilities to access networks.",
      "\n**4 &mdash; Denial-of-Service (DoS) Attacks**",
      "\nIoT devices can malfunction or shut down completely as a result of attackers flooding them with requests.",
      "While this may at most produce frustrating consequences when the device in question",
      "is a fitness band or a home assistant, the implications can be a lot more serious",
      "when the setting is industrial, medical or critical infrastructure can be affected",
      "such as via cars and transport.",
      "\n**5 &mdash; Physical Tampering**",
      "\nIoT devices can be physically accessed and tampered with by external or insider threats, ",
      "who may install or alter the underlying software.",
      "Naturally, this may lead to risks such as MITM attacks and allow an attacker",
      "to obtain or manipulate valuable flows of data.",
      "## Best Practices for Securing IoT Networks & Devices",
      "**1 &mdash; Stronger Authentication & Password Measures**",
      "\nEnforcing strong password policies and putting multi-factor authentication (MFA)",
      "into practice are essential for lowering the likelihood of unwanted access.",
      "MFA in particular is an example of layered security and can make sure",
      "that an attacker cannot access relevant systems even if the credentials",
      "have been compromised. This suggestion can be viewed from both the consumer's perspective",
      "when choosing which IoT device or brand to purchase, and from the developer's",
      "perspective, as they are responsible for implementing the security methods in place.",
      "\n**2 &mdash; Segmenting a network**",
      "\nMore a concern from the developer's side, attackers can be stopped from moving",
      "laterally through a compromised system by isolating IoT devices from other areas of the network.",
      "The possible impact of an attack is decreased by setting up distinct networks for IoT devices.",
      "\n**3 &mdash; Monitoring and Alerts in Real Time**",
      "\nAnother means which IoT developers ought to consider is continually monitoring",
      "IoT devices for abnormal activity. While it is seriously impractical",
      "and unrealistic to expect brands to take on this risk when selling",
      "consumer grade or trivial IoT devices, it is a legitimate consideration",
      "when critical infrastructure is dependent on the safe operation of IoT",
      "technologies.",
      "One of the main reasons this is the case is because entities are more likely",
      "to expend resources on security systems here due to the cost of doing so",
      "likely being suignificantly smalelr than the costs where a security breach occurs.",
      "Government regulations and legal requirements may also incentivise IoT developers",
      "to take on such practices in vital domains."
    ],
    "sources": [
      "## Further Reading",
      "* [IoT security — an overview](https://azure.microsoft.com/en-gb/resources/cloud-computing-dictionary/what-is-iot/security)",
      "* [What is the Internet of Things?](https://www.ibm.com/topics/internet-of-things)",
      "* [What is IoT Cyber Security?](https://darktrace.com/cyber-ai-glossary/iot-cyber-security)",
      "* [Internet of Risks: Cybersecurity Risk in the Internet of Things](https://www.upguard.com/blog/iot-port-risk)"
    ],    
    "tags": ["Cybersecurity", "Privacy", "Technology"]
  },
  {
    "id": 9,
    "title": "Ethical Hacking: An Intriguing Moral Dilemma",
    "content": [
      "The notion of an ethical hacker may seem like an oxymoron at first,", 
      "but practical realities have pushed many organisations to realise", 
      "that if they want to make their systems more secure, they will need",
      "to engage with ethical hacking.",
      "\nThis is where the idea of ethical hackers comes in.",
      "Such hackers tend to operate with official permission and without the",
      "ultimate goal of damaging or harming any systems or technologies.",
      "These ethical hackers are labelled 'white hat hackers' and can be",
      "distinguished from 'black hat hackers', who usually engage in",
      "hacking in malicious or criminal ways, and typically for monetary benefits.",
      "In between these two concepts is the idea of a 'grey hat hacker', someone",
      "who may not have any malicious intent in their actions but may still",
      "break certain laws or violate ethical guidelines.",
      "\nOne clear benefit of ethical hackers is that they operate so with the",
      "attacker mindset or attacker point-of-view in mind. It might be good to",
      "have a solid cybersecurity staff at your firm which performs routine",
      "internal assessments and is on-call/ready to respond to any serious",
      "security incidents, but this does woefully little to address the perspective",
      "of malicious hackers, who operate outside of the law and will only attack",
      "once vulnerabilities have been discovered.",
      "\nEthical hackers fulfill this gap, as they can conduct simulated attacks",
      "from a wide variety of vectors that real-world attackers could possibly",
      "utilise.",
      "However, it is important to remember that the ultimate goal of ethical hackers",
      "is not to for example, steal data or damage an organisation's systems, but",
      "to find vulnerabilities which could hopefully be accounted for or have their",
      "corresponding risks mitigated in the future by the relevant organisation.",
      "## The Phases of the Ethical Hacker's Work Cycle",
      "**Reconnaissance & Scanning &mdash;** Though these two categories are sometimes",
      "split into two distinct parts, they usually involve similiar concepts of",
      "gathering information about the target network, its users, and network structure.",
      "The emphasis is on vulnerabilities and weak points that the hacker will eventually",
      "want to exploit.",
      "\n**Attacking the System &mdash;** At this stage, the attacker utilises",
      "relevant tools to engage with the indentified vulnerabilities from the",
      "previous stage to actually gain access to the system. Tools here could",
      "include SQL injection, social engineering and denial-of-service (DoS) attacks.",
      "\n**Maintaining Access & Covering Tracks &mdash;** Another stage that could",
      "possibly be split into two, this phase usually involves testing to what",
      "extent an attacker can discreetly stay in the system and hide their involvement",
      "in the case they are discovered.",
      "This stage can involve the encryption and deletion of files, trojan horses",
      "being installed on the network and backdoors being established.",
      "\n**Reporting &mdash;** It would be futile to test a security system",
      "without recording findings such that any vulnerabilities and weaknesses",
      "could be remedied in the future.",
      "## Examining a Real-Life Hacking Scenario Through an Ethical Lens",
      "The final section of this article will explore a real-life situation",
      "in cybersecurity but do so whilst considering the ethical implications",
      "and what this means for security more broadly.",
      "### An Introduction to the MedSec Controversy",
      "In 2016, security research group MedSec found multiple vulnerabilities in",
      "a number of St. Jude Medical devices (pacemakers, heart monitoring devices etc).",
      "Instead of disclosing these vulnerabilities directly to St. Jude Medical,",
      "MedSec partnered with an investment firm called Muddy Waters to short the",
      "stock of St. Jude Medical with the ultimate goal of making profit.",
      "They would go on to publicly reveal some of the vulnerabilities,",
      "capitalising on the stock drop and making some (but relatively marginal) profit.",
      "### White, Black or Grey Hat?",
      "First, it's undeniable that MedSec was guided by self-interest and profit.",
      "There is no other way to describe their behaviour in partnering with an investment",
      "firm and attempting to play the stock market.",
      "This makes it difficult to categorise MedSec as white hat hackers, as they",
      "did not seek or obtain official permission from St. Jude Medical when",
      "testing and reporting on the vulnerabilities of the medical devices in",
      "question.",
      "\nThe situation MedSec was in is also inherently likely to generate",
      "conflicts of interest. Such conflicts stem from the fact that MedSec is a",
      "research group, who while private and ultimately focused on financial goals, still",
      "ought to both follow ethical guidelines in the field of research and",
      "(arguably) broadly use their expertise/skills for the greater good.",
      "\nOn the other hand, it should be reiterated that MedSec was indeed a private",
      "security research firm, so the situation is not as egregous as it would be",
      "if MedSec were funded by the government and/or were university researchers.",
      "It is also important to note the specific excuse MedSec used to justify their",
      "behaviour, with MedSec's CEO specifically citing the long track record of companies in the",
      "field of medical technology becoming aware of vulnerabilities and yet taking",
      "minimal action to address them.",
      "\nFrom MedSec's point of view, the idea of profit may have been a relevant",
      "and beneficial outcome of their course of action, but they also legitimately might ",
      "have thought that they were morally justified in doing so on the grounds",
      "that their approach was significantly more likely to incentivise St. Jude Medical",
      "to actually act and remedy the underlying technological flaws.",
      "It is also worth raising that MedSec also did not actually breach",
      "any technology or financial laws with their actions.",
      "\nThus, it also makes it hard to label MedSec as black hat hackers, as though",
      "their actions were ethically dubious, they did not breach any laws or set out",
      "to exclusively act in self-interest or malice.",
      "This consequently leads me to label MedSec as grey hat hackers but I'm keen to hear",
      "what you (the reader) thinks, so please enter and submit your comment",
      "below!",
      "### On Cybersecurity Ethics More Generally",
      "Just to quickly mention, I think a large source of the ethical controversy here is that",
      "cybersecurity professionals or computer scientists more generally don't have",
      "an ethical code of conduct they can defer which exists in other professions such",
      "as medicine and law.",
      "While things like the Menlo Report or the ACM Code of Ethics and Conduct",
      "exist, these tend to have serious flaws which prevent or complicate",
      "their application in practice.",
      "\nWhile I personally view MedSec's conduct as more leaning towards unethical",
      "and hyper capitalist, I still understand the moral justifications put forward",
      "by them and the fact that no party was likely 'good'.",
      "The notion of corporations, no matter how big, giving statements where",
      "they say their cybersecurity team is top-notch and that no vulnerabilities",
      "could possibly exist in their software/products is way too common.",
      "How society's views on situations such as the MedSec controversy will change into the future",
      "is hard to predict and will be contingent on how the field of cybersecurity itself evolves."
    ],
    "sources": [
      "## Further Reading",
      "* [What is ethical hacking?](https://www.ibm.com/topics/ethical-hacking)",
      "* [What is Ethical Hacking](https://www.eccouncil.org/cybersecurity-exchange/ethical-hacking/what-is-ethical-hacking/)",
      "* Ethics in Cybersecurity Research and Practice - Technology in Society Volume 63 (November 2020, 101382)"
    ],    
    "tags": ["Cybersecurity"]
  },
  {
    "id": 10,
    "title": "The Role of AI in Cybersecurity",
    "content": [
      "\nThis is a dummy article that wasn't finished in time.", 
      "\nHowever, 8 out of the 10 intended articles were finished and you", 
      "can find and read them directly through the **Articles** or **Tags**",
      "pages in the header.",
      "\n"
    ],
    "sources": [
      ""
    ],    
    "tags": ["AI", "Cybersecurity", "Technology"]
  }
]